<!-- Функція date
Для вирішення завдань цього блоку вам знадобляться такі функції: date.
  Виведіть на екран поточний рік, місяць, день, годину, хвилину, секунду.
  Виведіть поточну дату-час у форматах '2025-12-31', '31.12.2025', '31.12.13', '12:59:59'.
  За допомогою функцій mktime та date виведіть 12 лютого 2025 року у форматі '12.02.2025'.
  Створіть масив днів тижня $week. Виведіть на екран назву поточного дня тижня за допомогою масиву $week та функції date. 
  Дізнайтеся, який день тижня був 06.06.2006, у ваш день народження.
  Створіть масив місяців $month. Виведіть на екран назву поточного місяця за допомогою масиву $month та функції date.
  Знайдіть кількість днів у поточному місяці. Скрипт повинен працювати незалежно від місяця, коли він запущений. 

-->

<?php

echo date('Y-m-d h:i:s') . '</br>';
echo date('Y-m-d') . '</br>';
echo date('d.m.Y') . '</br>';
echo date('d.m.y') . '</br>';
echo date('h:i:s') . '</br>';
echo date('d.m.Y', mktime(0, 0, 0, 2, 12, 2025)) . '</br>';

$week = [
    1 => 'Monday',
    2 => 'Tuesday',
    3 => 'Wednesday',
    4 => 'Thursday',
    5 => 'Friday',
    6 => 'Saturday',
    7 => 'Sunday',
];

echo $week[date('w')] . '</br>';
echo $week[date('w', strtotime('2006-06-06'))] . '</br>';

$month = [
    1 => 'January',
    2 => 'February',
    3 => 'March',
    4 => 'April',
    5 => 'May',
    6 => 'June',
    7 => 'July',
    8 => 'August',
    9 => 'September',
    10 => 'October',
    11 => 'November',
    12 => 'December',
];

echo $month[idate('m')] . '</br>';
echo date('t') . '</br>';

?>

