<!-- Timestamp: time та mktime
Для вирішення завдань цього блоку вам знадобляться такі функції: time, mktime.
  Виведіть поточний час у форматі timestamp.
  Виведіть 1 березня 2025 року у форматі timestamp.
  Виведіть 31 грудня поточного року у форматі timestamp. Скрипт повинен працювати незалежно від року, коли він запущений.
  Знайдіть кількість секунд, що пройшли з 13:12:59 15 березня 2000 року до теперішнього часу.
  Знайдіть кількість годин, що пройшли з 7:23:48 поточного дня до цього часу. -->

<?php

echo time() . '</br>';
echo strtotime('01.03.2025') . '</br>';
echo mktime(0, 0, 0, 12, 31, date('Y')) . '</br>';
$count = time() - mktime(13, 12, 59, 03, 15, 2000);
echo $count . '</br>';

$last = "2023-02-16 7:23:48";
$today = time();
$last = strtotime($last);
echo round(abs($today-$last)/60/60);

?>

